In [1]:
import pandas as pd

In [2]:
#declare movie rating dataframe: ratings from 1 to 5 (star * rating)
df_movie_rating = pd.DataFrame({
    'movie 1': [5, 4, 3, 3, 2, 1],
    'movie 2': [4, 5, 2, 3, 4, 2]}, index=['Tom', 'Jeff', 'Peter', 'Ram', 'Ted', 'Paul'])

In [3]:
df_movie_rating

       movie 1  movie 2
Tom          5        4
Jeff         4        5
Peter        3        2
Ram          3        3
Ted          2        4
Paul         1        2

In [4]:
def movie_grade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    if rating==2:
        return 'D'
    if rating==1:
        return 'E'
    else:
        return 'F'

In [5]:
print(movie_grade(5))

A

In [6]:
df_movie_rating.applymap(movie_grade)

      movie 1 movie 2
Tom         A       B
Jeff        B       A
Peter       C       D
Ram         C       C
Ted         D       B
Paul        E       D

### Data Operation with Statistical Functions

In [7]:
df_test_scores = pd.DataFrame({'Test1': [95, 84, 73, 88, 82, 61],
                              'Test2': [74, 85, 82, 73, 77, 79]},
                              index=['Jack', 'Lewis', 'Patrick', 'Rich', 'Kelly', 'Paula'])

In [8]:
df_test_scores.max()

Test1    95
Test2    85
dtype: int64

In [9]:
df_test_scores.mean()

Test1    80.500000
Test2    78.333333
dtype: float64

In [10]:
df_test_scores.std() # std function to find the standard deviation

Test1    11.979149
Test2     4.633213
dtype: float64

### Data Operation using GroupBy

In [11]:
df_president_name = pd.DataFrame({'first': ['George', 'Bill', 'Ronald', 'Jimmy', 'George'],
                                 'last': ['Bush', 'Clinton', 'Regan', 'Carter', 'Washington']})
df_president_name

    first        last
0  George        Bush
1    Bill     Clinton
2  Ronald       Regan
3   Jimmy      Carter
4  George  Washington

In [12]:
grouped_by_first = df_president_name.groupby('first')

In [13]:
grouped_data = grouped_by_first.get_group('George')
grouped_data

    first        last
0  George        Bush
4  George  Washington

### Data Operation with Sorting

In [14]:
df_president_name.sort_values('first')

    first        last
1    Bill     Clinton
0  George        Bush
4  George  Washington
3   Jimmy      Carter
2  Ronald       Regan

### Data Standardization

In [16]:
def standardize_tests(test):
    return (test - test.mean()) / test.std()

In [22]:
standardize_tests(df_test_scores['Test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [23]:
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests) #apply function to entire dataset

In [24]:
standardize_test_scores(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889

### Merge, Duplicate and Concatenate

In [25]:
df_student_math = pd.DataFrame({'student': ['Tom', 'Jack', 'Dan', 'Ram', 'Jeff', 'David'],
                                'ID': [10, 56, 31, 85, 9, 22]
                               })
df_student_science = pd.DataFrame({'student': ['Tom', 'Ram', 'David'],
                                  'ID': [10, 12, 22]
                                  })

In [26]:
#merge both dataframes to form a single dataframe with math and science data
pd.merge(df_student_math, df_student_science)

  student  ID
0     Tom  10
1   David  22

In [27]:
#merge with key on student
pd.merge(df_student_math, df_student_science, on='student')

  student  ID_x  ID_y
0     Tom    10    10
1     Ram    85    12
2   David    22    22

In [28]:
#merge left join on key ID and also fill NaN values with X
pd.merge(df_student_math, df_student_science, on='ID', how='left').fillna('X')

  student_x  ID student_y
0       Tom  10       Tom
1      Jack  56         X
2       Dan  31         X
3       Ram  85         X
4      Jeff   9         X
5     David  22     David

In [30]:
#concatenate dataframes
pd.concat([df_student_math, df_student_science], ignore_index=True)

  student  ID
0     Tom  10
1    Jack  56
2     Dan  31
3     Ram  85
4    Jeff   9
5   David  22
6     Tom  10
7     Ram  12
8   David  22

In [31]:
#define new dataframe with student survey data
df_student_survey = pd.DataFrame({'student': ['Tom', 'Jack', 'Tom', 'Ram', 'Jeff', 'Jack'],
                                 'ID': [10, 56, 10, 85, 9, 56]
                                 })
df_student_survey

  student  ID
0     Tom  10
1    Jack  56
2     Tom  10
3     Ram  85
4    Jeff   9
5    Jack  56

In [32]:
#check for duplicates
df_student_survey.duplicated()

0    False
1    False
2     True
3    False
4    False
5     True
dtype: bool

In [33]:
#drop duplicated values with student as key
df_student_survey.drop_duplicates('student')

  student  ID
0     Tom  10
1    Jack  56
3     Ram  85
4    Jeff   9